rust-paper-scissors.org
#+title: Rust, Paper, Scissors
#+author: Jens Östlund
#+email: jens.ostlund@futurice.com
#+language: en
#+options: toc:nil
#+options: num:2
#+export_file_name: docs/index.html
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="style-overrides.css" />

/This text is an outline for a hands-on Rust workshop for beginners held at [[https://futurice.com/][Futurice]]. The content is geared towards developers with a background in more dynamic languages such as JavaScript or Python but who has no prior experience coding in Rust./

Let's learn a bit of Rust through a game of ✊✋✌️! We will be implementing a CLI app for playing rock, paper, scissors.

A quick reminder of the rules of the game:

- Each player selects either rock, paper or scissors
- Players reveal their pick at the same time
- The winner is decided according to the following rules:
  - Rock beats scissors
  - Scissors beat paper
  - Paper beats rock

Usually the game is played best of three rounds and can include multiple people. For the sake of time we will only consider a two player game (human vs. computer) of 1 round.

By following the instructions and tackling the exercises below you will should get a feel for the Rust workflow and the language itself.

To follow along you will need to have ~cargo~, the build tool, and ~rustc,~ the Rust compiler, installed. I've used ~rustc~ version 1.57.0 when writing article. I recommend using using [[https://rustup.rs/][rustup]] if you need to install them.

There is [[https://github.com/iensu/janken/][a reference repository]] which follows the article. If you get stuck at one of the exercises you can have a look at the commit history of the project to get inspiration on how to move forward.

As the article progresses more assumptions will be made about the code you have written. For instance, I make the assumption that you will write code that follows idiomatic JavaScript or Python patterns and will introduce rustier ways of doing things as we go along. The reason being that I want you to solve the exercise yourself first and keep blind code copying to a minimum. If your solution starts to diverge and you end up at a place where my instructions do not make sense, most likely you've thought ahead so move on to the next step.

* Humble beginnings
We need to create a project for our app, but before that we need a name. Let's call it /janken/ (じゃん拳), the Japanese name for the game. You can create your project using ~cargo~:

#+begin_src shell
  $ cargo new janken
#+end_src

This will create a project with a very simple Rust application (binary) with only one source file: =./src/main.rs= and a =Cargo.toml= project manifest file. Git has also already been setup for you.

You can run your application like so:

#+begin_src shell
  $ cargo run
#+end_src

That command will compile your application and run it. The actual application binary has been written to =./target/debug/janken=. Now try this:

#+begin_src shell
  $ ./target/debug/janken
#+end_src

Rust compiles your application down to machine code so you can execute the binary directly; there is no need for an external program to execute it like for example with Node.js or Python.

We need to be able to decide who the winner is so let's create a function that takes two hand shapes and returns ~true~ if the first argument is the winner, ~false~ otherwise. Since we're still a bit away from being able to test the logic ourselves, let's start with writing some tests.

** Writing tests
In Rust we usually tests write tests in a private module in the same file (*module*) as the implementation.

#+begin_src rust

  // This annotation makes sure the `tests` module is
  // only compiled when running tests.
  #[cfg(test)]
  mod tests {
      // We import everything in our parent module.
      use super::*;

      // This annotation tells the test runner that the
      // function should be run as a test.
      #[test]
      fn is_meaning_of_life() {
          let meaning_of_life = 42;

          // Make the assertion.
          // It is customary to put the expected result on
          // the left and the calculated value on the right.
          assert_eq!(42, meaning_of_life);
      }
  }
#+end_src

*EXERCISE 1:* Add a test called ~rock-wins-over-scissors~ that calls a function called ~is_winner~ with the arguments ~"rock"~ and ~"scissors"~ and expect the result to be ~true~.

** Partial implementations
Now when you try to run the tests the code will not compile since the ~is_winner~ function has not yet been defined. Often you will want to try things out before you've figured out all the details of your implementation and made the code compile. Rust has a neat feature for this: the ~todo!()~ macro. The ~todo!()~ macro will allow your code to compile without you having finished the implementation.

#+begin_src rust
  fn is_winner(p1: &str, p2: &str) -> bool {
      todo!()
  }
#+end_src

Now we are able to run the test, but it fails with the message /not yet implemented/.

*EXERCISE 2:* Make the test pass and a test case for when ~is_winner~ should return ~false~.

*EXERCISE 3:* Follow the same procedure and implement the remaining two cases.

* Rustifying the code
There are multiple issues with our ~is_winner~ function, for one it does not handle draws yet (we will address that later).

Another issue is that the current implementation does not properly codify the domain: we are just matching on plain strings everywhere. Since we know we can only have three different hand shape values, we should express that in the code. In Rust this is done with an ~enum~. You can [[https://doc.rust-lang.org/book/ch06-01-defining-an-enum.html?highlight=enum#the-option-enum-and-its-advantages-over-null-values][read more about them here]].

** Our first enum
*EXERCISE 4*: Implement an ~enum~ called ~HandShape~ for all the hand shapes.

When you try to replace the strings with your new, fancy ~HandShape~ ~enum~ you'll notice that it won't compile. The reason is that the compiler doesn't know how to do comparisons between ~HandShape~ instances; nowhere have we told it how we want equality comparisons to work. Fortunately we do not have to write code for this ourselves.

