docs/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-12-09 Thu 13:26 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Rust, Paper, Scissors</title>
<meta name="author" content="Jens Östlund" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style-overrides.css" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">Rust, Paper, Scissors</h1>
</header><p>
<i>This text is an outline for a hands-on Rust workshop for beginners held at <a href="https://futurice.com/">Futurice</a>. The content is geared towards developers with a background in more dynamic languages such as JavaScript or Python but who has no prior experience coding in Rust.</i>
</p>

<p>
Let's learn a bit of Rust through a game of ✊✋✌️! We will be implementing a CLI app for playing rock, paper, scissors.
</p>

<p>
A quick reminder of the rules of the game:
</p>

<ul class="org-ul">
<li>Each player selects either rock, paper or scissors</li>
<li>Players reveal their pick at the same time</li>
<li>The winner is decided according to the following rules:
<ul class="org-ul">
<li>Rock beats scissors</li>
<li>Scissors beat paper</li>
<li>Paper beats rock</li>
</ul></li>
</ul>

<p>
Usually the game is played best of three rounds and can include multiple people. For the sake of time we will only consider a two player game (human vs. computer) of 1 round.
</p>

<p>
By following the instructions and tackling the exercises below you will should get a feel for the Rust workflow and the language itself.
</p>

<p>
To follow along you will need to have <code>cargo</code>, the build tool, and <code>rustc,</code> the Rust compiler, installed. I've used <code>rustc</code> version 1.57.0 when writing article. I recommend using using <a href="https://rustup.rs/">rustup</a> if you need to install them.
</p>

<p>
There is <a href="https://github.com/iensu/janken/">a reference repository</a> which follows the article. If you get stuck at one of the exercises you can have a look at the commit history of the project to get inspiration on how to move forward.
</p>

<p>
As the article progresses more assumptions will be made about the code you have written. For instance, I make the assumption that you will write code that follows idiomatic JavaScript or Python patterns and will introduce rustier ways of doing things as we go along. The reason being that I want you to solve the exercise yourself first and keep blind code copying to a minimum. If your solution starts to diverge and you end up at a place where my instructions do not make sense, most likely you've thought ahead so move on to the next step.
</p>

<div id="outline-container-org2f81885" class="outline-2">
<h2 id="org2f81885"><span class="section-number-2">1.</span> Humble beginnings</h2>
<div class="outline-text-2" id="text-1">
<p>
We need to create a project for our app, but before that we need a name. Let's call it <i>janken</i> (じゃん拳), the Japanese name for the game. You can create your project using <code>cargo</code>:
</p>

<div class="org-src-container">
<pre class="src src-shell">$ cargo new janken
</pre>
</div>

<p>
This will create a project with a very simple Rust application (binary) with only one source file: <code>./src/main.rs</code> and a <code>Cargo.toml</code> project manifest file. Git has also already been setup for you.
</p>

<p>
You can run your application like so:
</p>

<div class="org-src-container">
<pre class="src src-shell">$ cargo run
</pre>
</div>

<p>
That command will compile your application and run it. The actual application binary has been written to <code>./target/debug/janken</code>. Now try this:
</p>

<div class="org-src-container">
<pre class="src src-shell">$ ./target/debug/janken
</pre>
</div>

<p>
Rust compiles your application down to machine code so you can execute the binary directly; there is no need for an external program to execute it like for example with Node.js or Python.
</p>

<p>
We need to be able to decide who the winner is so let's create a function that takes two hand shapes and returns <code>true</code> if the first argument is the winner, <code>false</code> otherwise. Since we're still a bit away from being able to test the logic ourselves, let's start with writing some tests.
</p>
</div>

<div id="outline-container-org7357620" class="outline-3">
<h3 id="org7357620"><span class="section-number-3">1.1.</span> Writing tests</h3>
<div class="outline-text-3" id="text-1-1">
<p>
In Rust we usually tests write tests in a private module in the same file (<b>module</b>) as the implementation.
</p>

<div class="org-src-container">
<pre class="src src-rust">
<span style="color: #a8a8a8; font-style: italic;">// </span><span style="color: #a8a8a8; font-style: italic;">This annotation makes sure the `tests` module is</span>
<span style="color: #a8a8a8; font-style: italic;">// </span><span style="color: #a8a8a8; font-style: italic;">only compiled when running tests.</span>
<span style="color: #ff9077;">#[cfg(test)]</span>
<span style="color: #b6a0ff;">mod</span> <span style="color: #00bcff;">tests</span> {
    <span style="color: #a8a8a8; font-style: italic;">// </span><span style="color: #a8a8a8; font-style: italic;">We import everything in our parent module.</span>
    <span style="color: #b6a0ff;">use</span> <span style="color: #b6a0ff;">super</span>::*;

    <span style="color: #a8a8a8; font-style: italic;">// </span><span style="color: #a8a8a8; font-style: italic;">This annotation tells the test runner that the</span>
    <span style="color: #a8a8a8; font-style: italic;">// </span><span style="color: #a8a8a8; font-style: italic;">function should be run as a test.</span>
    <span style="color: #ff9077;">#[test]</span>
    <span style="color: #b6a0ff;">fn</span> <span style="color: #feacd0;">is_meaning_of_life</span>() {
        <span style="color: #b6a0ff;">let</span> <span style="color: #00d3d0;">meaning_of_life</span> = 42;

        <span style="color: #a8a8a8; font-style: italic;">// </span><span style="color: #a8a8a8; font-style: italic;">Make the assertion.</span>
        <span style="color: #a8a8a8; font-style: italic;">// </span><span style="color: #a8a8a8; font-style: italic;">It is customary to put the expected result on</span>
        <span style="color: #a8a8a8; font-style: italic;">// </span><span style="color: #a8a8a8; font-style: italic;">the left and the calculated value on the right.</span>
        <span style="color: #ff9077;">assert_eq!</span>(42, meaning_of_life);
    }
}
</pre>
</div>

<p>
<b>EXERCISE 1:</b> Add a test called <code>rock-wins-over-scissors</code> that calls a function called <code>is_winner</code> with the arguments <code>"rock"</code> and <code>"scissors"</code> and expect the result to be <code>true</code>.
</p>
</div>
</div>

<div id="outline-container-orgca05f98" class="outline-3">
<h3 id="orgca05f98"><span class="section-number-3">1.2.</span> Partial implementations</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Now when you try to run the tests the code will not compile since the <code>is_winner</code> function has not yet been defined. Often you will want to try things out before you've figured out all the details of your implementation and made the code compile. Rust has a neat feature for this: the <code>todo!()</code> macro. The <code>todo!()</code> macro will allow your code to compile without you having finished the implementation.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #b6a0ff;">fn</span> <span style="color: #feacd0;">is_winner</span>(<span style="color: #00d3d0;">p1</span>: &amp;<span style="color: #6ae4b9;">str</span>, <span style="color: #00d3d0;">p2</span>: &amp;<span style="color: #6ae4b9;">str</span>) -&gt; <span style="color: #6ae4b9;">bool</span> {
    <span style="color: #ff9077;">todo!</span>()
}
</pre>
</div>

<p>
Now we are able to run the test, but it fails with the message <i>not yet implemented</i>.
</p>

<p>
<b>EXERCISE 2:</b> Make the test pass and a test case for when <code>is_winner</code> should return <code>false</code>.
</p>

<p>
<b>EXERCISE 3:</b> Follow the same procedure and implement the remaining two cases.
</p>
</div>
</div>
</div>

<div id="outline-container-org7ba4b27" class="outline-2">
<h2 id="org7ba4b27"><span class="section-number-2">2.</span> Rustifying the code</h2>
<div class="outline-text-2" id="text-2">
<p>
There are multiple issues with our <code>is_winner</code> function, for one it does not handle draws yet (we will address that later).
</p>

<p>
Another issue is that the current implementation does not properly codify the domain: we are just matching on plain strings everywhere. Since we know we can only have three different hand shape values, we should express that in the code. In Rust this is done with an <code>enum</code>. You can <a href="https://doc.rust-lang.org/book/ch06-01-defining-an-enum.html?highlight=enum#the-option-enum-and-its-advantages-over-null-values">read more about them here</a>.
</p>
</div>

<div id="outline-container-org8fe7808" class="outline-3">
<h3 id="org8fe7808"><span class="section-number-3">2.1.</span> Our first enum</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<b>EXERCISE 4</b>: Implement an <code>enum</code> called <code>HandShape</code> for all the hand shapes.
</p>

<p>
When you try to replace the strings with your new, fancy <code>HandShape</code> <code>enum</code> you'll notice that it won't compile. The reason is that the compiler doesn't know how to do comparisons between <code>HandShape</code> instances; nowhere have we told it how we want equality comparisons to work. Fortunately we do not have to write code for this ourselves.
</p>
</div>
</div>
