rust-paper-scissors.org
** Derivable traits and the derive macro
Traits define a behavior contract that a type can adhere to, very similar to interfaces in other languages. Often you have to provide an implementation for the functions that a trait specifies, but some traits are *derivable*, that means that the Rust compiler can automatically generate the necessary code for us instead! Common derivable traits are ~PartialEq~ for equality comparisons and ~Debug~ for printing the type.

#+begin_src rust
  #[derive(PartialEq, Debug)]
  enum HandShape {
      Rock,
      Paper,
      Scissors,
  }

  // Now we can compare: HandShape::Rock != HandShape::Scissors
  // And log our HandShape: println!("{:?}", HandShape::Rock);
#+end_src

*EXERCISE 5:* Make your ~HandShape~ enum derive ~PartialEq~ and ~Debug~.

** Pattern matching
One of the most useful features of Rust is its pattern matching capabilities, it's like a ~switch~ on steroids which not only helps you avoid complicated ~if~ chains, but also checks for exhaustiveness making sure you handle all of the possible scenarios.

#+begin_src rust
  let foo = 666;

  match foo {
      666 => println!("The beast!"),
      665 => println!("The neighbor of the beast!"),
      _ => println!("Not the beast..."),
  }
#+end_src

*EXERCISE 6*: Replace your implementation with a match clause (Hint: you can build ad-hoc tuples: ~(x, y)~).

All tests should be passing now, yay!

** What about draws?
Currently our ~is_winner~ function only returns a ~bool~. There's no way for us to indicate a draw! Let's use an enum to encapsulate the three different possible round results.

*EXERCISE 7:* Implement a ~RoundResult~ enum which captures the three possible states: win, loss or draw.

*EXERCISE 8:* Add tests for the draw cases and then add the draw handling functionality to the ~is_winner~ function.

** A little refactoring...
Now that we have our logic down we are ready to move on to focusing on interacting with the outside world. However, before we go there we need just a little bit of clean-up.

The name ~is_winner~ made sense when all we did was return a ~bool~. Now that we are returning a ~RoundResult~ we should revisit the name to make our code a bit clearer. Let's rename it to ~execute_round~ and add a doc string to explain that result is from the perspective of the left-hand argument.

*EXERCISE 9:* Rename ~is_winner~ to ~execute_round~ and add a doc string to it (using ~///~).

Our main.rs file is getting a bit long as well. Ideally we want the main.rs file to short and only focus on running the application. Let's create a new file: lib.rs and move all our game logic there.

*EXERCISE 10:* Move everything except the ~main~ function into a file called /lib.rs/.

If you run the tests again now you will see a bunch of warnings about dead code and things not being used. This is because lib.rs is a separate module from main.rs which is our entrypoint to the application. All of our functions and enums currently live in lib.rs and since everything is *private by default* in Rust, no-one is able to use them. Let's fix that by marking the functions with ~pub~ and thus make them publicly exposed.

*EXERCISE 11:* Make the functions and enums in lib.rs public.

When you run the tests now you'll notice that not only did the warnings disappear, we've gotten an additional paragraph for Doc-tests in the output, what's up with that?

** Documentation
Another great feature of Rust is the focus on documentation: Cargo comes with built-in documentation capabilities. All comments starting with ~///~ are so-called doc strings and can be extracted into a standardized documentation website by running:

#+begin_src shell
  $ cargo doc --open
#+end_src

Doc strings are written in markdown and support adding code examples as in regular markdown. Code examples in doc strings for public functions will be executed when running ~cargo test~ which is great since it ensures the examples compile and are up-to-date. Now, let's add a simple doc test for ~execute_round~.

*EXERCISE 12*: Add a doc test for ~execute_round~. (Hint: you can import your functions and enums with ~use janken::*;.~)

* Interacting with the outside world
Let's shift our focus back to main.rs and turn our game logic into an actual game.

** Reading input from stdin
Reading from stdin looks a little bit different than in Node.js or Python in that you first allocate a buffer string to populate:

#+begin_src rust
  // Prepare a buffer to write the data into
  let mut buffer = String::new();
  // Get a handle to stdin
  let stdin = std::io::stdin();

  println!("Write something:");

  // Read a line
  stdin.read_line(&mut buffer).unwrap();

  // Print the result
  println!("You wrote: {}", buffer);
#+end_src

*EXERCISE 13*: Add the code above to your ~main~ function and run it with ~cargo run~.

In Rust everything is immutable by default, that is: once you set a variable you can't modify its value. In order to allow modification of a variable you have to declare it as mutable with the ~mut~ keyword.

If you have sharp eyes you might have noticed something else that stand out in the code above: what is that ~unwrap()~ call doing?

