docs/index.html

<div id="outline-container-org083331a" class="outline-3">
<h3 id="org083331a"><span class="section-number-3">2.2.</span> Derivable traits and the derive macro</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Traits define a behavior contract that a type can adhere to, very similar to interfaces in other languages. Often you have to provide an implementation for the functions that a trait specifies, but some traits are <b>derivable</b>, that means that the Rust compiler can automatically generate the necessary code for us instead! Common derivable traits are <code>PartialEq</code> for equality comparisons and <code>Debug</code> for printing the type.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #ff9077;">#[derive(PartialEq, Debug)]</span>
<span style="color: #b6a0ff;">enum</span> <span style="color: #6ae4b9;">HandShape</span> {
    <span style="color: #6ae4b9;">Rock</span>,
    <span style="color: #6ae4b9;">Paper</span>,
    <span style="color: #6ae4b9;">Scissors</span>,
}

<span style="color: #a8a8a8; font-style: italic;">// </span><span style="color: #a8a8a8; font-style: italic;">Now we can compare: HandShape::Rock != HandShape::Scissors</span>
<span style="color: #a8a8a8; font-style: italic;">// </span><span style="color: #a8a8a8; font-style: italic;">And log our HandShape: println!("{:?}", HandShape::Rock);</span>
</pre>
</div>

<p>
<b>EXERCISE 5:</b> Make your <code>HandShape</code> enum derive <code>PartialEq</code> and <code>Debug</code>.
</p>
</div>
</div>

<div id="outline-container-org3b9149e" class="outline-3">
<h3 id="org3b9149e"><span class="section-number-3">2.3.</span> Pattern matching</h3>
<div class="outline-text-3" id="text-2-3">
<p>
One of the most useful features of Rust is its pattern matching capabilities, it's like a <code>switch</code> on steroids which not only helps you avoid complicated <code>if</code> chains, but also checks for exhaustiveness making sure you handle all of the possible scenarios.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #b6a0ff;">let</span> <span style="color: #00d3d0;">foo</span> = 666;

<span style="color: #b6a0ff;">match</span> foo {
    666 =&gt; <span style="color: #f78fe7;">println!</span>(<span style="color: #79a8ff;">"The beast!"</span>),
    665 =&gt; <span style="color: #f78fe7;">println!</span>(<span style="color: #79a8ff;">"The neighbor of the beast!"</span>),
    _ =&gt; <span style="color: #f78fe7;">println!</span>(<span style="color: #79a8ff;">"Not the beast..."</span>),
}
</pre>
</div>

<p>
<b>EXERCISE 6</b>: Replace your implementation with a match clause (Hint: you can build ad-hoc tuples: <code>(x, y)</code>).
</p>

<p>
All tests should be passing now, yay!
</p>
</div>
</div>

<div id="outline-container-orgfda9cdb" class="outline-3">
<h3 id="orgfda9cdb"><span class="section-number-3">2.4.</span> What about draws?</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Currently our <code>is_winner</code> function only returns a <code>bool</code>. There's no way for us to indicate a draw! Let's use an enum to encapsulate the three different possible round results.
</p>

<p>
<b>EXERCISE 7:</b> Implement a <code>RoundResult</code> enum which captures the three possible states: win, loss or draw.
</p>

<p>
<b>EXERCISE 8:</b> Add tests for the draw cases and then add the draw handling functionality to the <code>is_winner</code> function.
</p>
</div>
</div>

<div id="outline-container-org7c90c6b" class="outline-3">
<h3 id="org7c90c6b"><span class="section-number-3">2.5.</span> A little refactoring&#x2026;</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Now that we have our logic down we are ready to move on to focusing on interacting with the outside world. However, before we go there we need just a little bit of clean-up.
</p>

<p>
The name <code>is_winner</code> made sense when all we did was return a <code>bool</code>. Now that we are returning a <code>RoundResult</code> we should revisit the name to make our code a bit clearer. Let's rename it to <code>execute_round</code> and add a doc string to explain that result is from the perspective of the left-hand argument.
</p>

<p>
<b>EXERCISE 9:</b> Rename <code>is_winner</code> to <code>execute_round</code> and add a doc string to it (using <code>///</code>).
</p>

<p>
Our main.rs file is getting a bit long as well. Ideally we want the main.rs file to short and only focus on running the application. Let's create a new file: lib.rs and move all our game logic there.
</p>

<p>
<b>EXERCISE 10:</b> Move everything except the <code>main</code> function into a file called <i>lib.rs</i>.
</p>

<p>
If you run the tests again now you will see a bunch of warnings about dead code and things not being used. This is because lib.rs is a separate module from main.rs which is our entrypoint to the application. All of our functions and enums currently live in lib.rs and since everything is <b>private by default</b> in Rust, no-one is able to use them. Let's fix that by marking the functions with <code>pub</code> and thus make them publicly exposed.
</p>

<p>
<b>EXERCISE 11:</b> Make the functions and enums in lib.rs public.
</p>

<p>
When you run the tests now you'll notice that not only did the warnings disappear, we've gotten an additional paragraph for Doc-tests in the output, what's up with that?
</p>
</div>
</div>

<div id="outline-container-orgea9ed50" class="outline-3">
<h3 id="orgea9ed50"><span class="section-number-3">2.6.</span> Documentation</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Another great feature of Rust is the focus on documentation: Cargo comes with built-in documentation capabilities. All comments starting with <code>///</code> are so-called doc strings and can be extracted into a standardized documentation website by running:
</p>

<div class="org-src-container">
<pre class="src src-shell">$ cargo doc --open
</pre>
</div>

<p>
Doc strings are written in markdown and support adding code examples as in regular markdown. Code examples in doc strings for public functions will be executed when running <code>cargo test</code> which is great since it ensures the examples compile and are up-to-date. Now, let's add a simple doc test for <code>execute_round</code>.
</p>

<p>
<b>EXERCISE 12</b>: Add a doc test for <code>execute_round</code>. (Hint: you can import your functions and enums with <code>use janken::*;.</code>)
</p>
</div>
</div>
</div>

<div id="outline-container-orga9fc83a" class="outline-2">
<h2 id="orga9fc83a"><span class="section-number-2">3.</span> Interacting with the outside world</h2>
<div class="outline-text-2" id="text-3">
<p>
Let's shift our focus back to main.rs and turn our game logic into an actual game.
</p>
</div>

<div id="outline-container-org86265f5" class="outline-3">
<h3 id="org86265f5"><span class="section-number-3">3.1.</span> Reading input from stdin</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Reading from stdin looks a little bit different than in Node.js or Python in that you first allocate a buffer string to populate:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #a8a8a8; font-style: italic;">// </span><span style="color: #a8a8a8; font-style: italic;">Prepare a buffer to write the data into</span>
<span style="color: #b6a0ff;">let</span> <span style="color: #b6a0ff;">mut</span> <span style="color: #00d3d0;">buffer</span> = <span style="color: #6ae4b9;">String</span>::new();
<span style="color: #a8a8a8; font-style: italic;">// </span><span style="color: #a8a8a8; font-style: italic;">Get a handle to stdin</span>
<span style="color: #b6a0ff;">let</span> <span style="color: #00d3d0;">stdin</span> = <span style="color: #00bcff;">std</span>::<span style="color: #00bcff;">io</span>::stdin();

<span style="color: #f78fe7;">println!</span>(<span style="color: #79a8ff;">"Write something:"</span>);

<span style="color: #a8a8a8; font-style: italic;">// </span><span style="color: #a8a8a8; font-style: italic;">Read a line</span>
stdin.read_line(&amp;<span style="color: #b6a0ff;">mut</span> buffer).unwrap();

<span style="color: #a8a8a8; font-style: italic;">// </span><span style="color: #a8a8a8; font-style: italic;">Print the result</span>
<span style="color: #f78fe7;">println!</span>(<span style="color: #79a8ff;">"You wrote: </span><span style="color: #79a8ff; font-style: italic;">{}</span><span style="color: #79a8ff;">"</span>, buffer);
</pre>
</div>

<p>
<b>EXERCISE 13</b>: Add the code above to your <code>main</code> function and run it with <code>cargo run</code>.
</p>

<p>
In Rust everything is immutable by default, that is: once you set a variable you can't modify its value. In order to allow modification of a variable you have to declare it as mutable with the <code>mut</code> keyword.
</p>

<p>
If you have sharp eyes you might have noticed something else that stand out in the code above: what is that <code>unwrap()</code> call doing?
</p>
</div>
</div>
