rust-paper-scissors.org
** Error handling in Rust
Let's remove the ~unwrap()~ call and run our application again!

*EXERCISE 14*: Remove the ~unwrap()~ call and run ~cargo check~.

#+begin_src shell
  warning: unused `Result` that must be used
   --> src/main.rs:9:5
    |
  9 |     stdin.read_line(&mut buffer);
    |     ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
    |
    = note: `#[warn(unused_must_use)]` on by default
    = note: this `Result` may be an `Err` variant, which should be handled
#+end_src

Things can fail, especially when you're interacting with the outside world you don't know who and what you can trust. In Rust things that can fail are encapsulated in a ~Result<T, E>~ enum type which has two members ~Ok(T)~ and ~Err(E)~. ~T~ and ~E~ are generic type parameters and are placeholders for any type; this is called generics and works on the surface similarly to generics in TypeScript.

If you look at the type signature of ~stdin.readline()~ you will see that it has a return type of ~std::io::Result<usize>~. That means that it will either return a ~Ok(usize)~ with the number of bytes read, or an ~Err(std::io::Error)~. ~usize~ is one of Rust's many numeric types and represents the unsigned default integer size for your computer (most likely 64 bit or 32 bit).

By using ~unwrap()~ we discardi the error handling and blindly trust the operation will succeed. This is not great since if the operation fails we're not giving the user, or us for that matter, any relevant information about what failed. We can do better!

Since it's an enum we can treat it like we did our other enums: ~match~!

#+begin_src rust
  match stdin.read_line(&mut buffer) {
      Ok(_) => {
          println!("You wrote: {}", buffer);
      }
      Err(err) => {
          println!("Failed to read user input! {:?}", err);
      }
  }
#+end_src

The above pattern quickly becomes unwieldy and if we don't want to deal with the underlying error can use ~expect~ instead which allows us to provide a message if the operation fails:

#+begin_src rust
  stdin
      .read_line(&mut buffer)
      .expect("Failed to read from stdin");
#+end_src

The most idiomatic way however, and the one that combines brevity with explicitness is the ~?~ operator. By appending the ~?~ operator to a function call the call will either return the value inside the ~Ok~ type, or abort the parent function returning the error. This means we have to do a few changes to our ~main~ function:

#+begin_src rust
  fn main() -> Result<(), io::Error> {
      let mut buffer = String::new();
      let stdin = io::stdin();

      println!("Write something:");

      stdin.read_line(&mut buffer)?;

      println!("You wrote: {}", buffer);

      Ok(())
  }
#+end_src

*EXERCISE 15:* Add error handling using the ~?~ operator.

We've changed the return type to be a result of either ~Ok(())~, where ~()~ is void (similar here to ~undefined~ in JavaScript), or ~Err(io::Error)~. Now we can happily add the ~?~ operator to the ~read_line~ call as long as we remember to return a result as well.

There are more sophisticated ways to handle errors, but this is good enough for now!

** Turning user input into HandShape
Before we can call our ~execute_round~ function we need to take the user input and convert it into a ~HandShape~. Let's implement a function ~to_handshape(s: String) -> Result<HandShape, String>~ (we'll use ~String~ as the error type) which can turn the user input into a ~HandShape~.

*EXERCISE 16*: Implement ~to_handshape~ as described above.

*** The TryFrom trait
While the above approach works in Rust we often rely on methods like ~from()~, ~into()~, ~try_from()~ and ~try_into()~ to convert between types. You can add these methods to your type by implementing the traits ~From<T>~ and ~TryFrom<T>~. In our case we'll need the ~TryFrom~ trait since we cannot turn every possible user input into a ~HandShape~.

*EXERCISE 17*: Implement ~TryFrom<String>~ for ~HandShape~ and replace the call to ~to_handshape~ with ~HandShape::try_from(buffer)~.

*** String and &str
One thing you quickly stumble upon in Rust is the fact that it has two types of strings: ~String~ and ~&str~. ~String~ is a mutable, heap allocated buffer. That is, you can modify it in place, grow it or shrink it. ~str~, on the other hand, is called a /string slice/ and is an immutable view of a contiguous sequence of UTF-8 bytes in memory. You almost always encounter ~str~ as a reference: ~&str~. [[https://blog.thoughtram.io/string-vs-str-in-rust/][This blog post]] explains the difference in detail. We will briefly touch upon what a reference is when we go into ownership and borrowing.

In short, in-line strings in your code will always be of type ~&str~ unless you explicitly turn them into ~String~:s. As a beginner ~String~:s are a bit easier to work with since you don't have to think about ownership and lifetimes as much.

** Our game loop
Now we should have all the pieces we need to start implementing our actual game loop. There are many ways to loop in Rust:

+ ~loop~ is for infinite loops (which you can ~break~ out of)
+ ~while~ for looping until a predicate is false
+ ~for~ is for iterating over a iterator until it is empty

*EXERCISE 18:* Implement a game loop which loops until the player either wins or loses.

For now you can hard-code the computer's choice, we'll look into handling the computer player soon.

At this point you most likely have had the compiler, at one time or another, kindly tell you that you are using a value after it has been moved. Let's dig a little deeper into what that actually means and what we can do to resolve that kind of error.

