docs/index.html

<div id="outline-container-orga6a5420" class="outline-3">
<h3 id="orga6a5420"><span class="section-number-3">3.2.</span> Error handling in Rust</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Let's remove the <code>unwrap()</code> call and run our application again!
</p>

<p>
<b>EXERCISE 14</b>: Remove the <code>unwrap()</code> call and run <code>cargo check</code>.
</p>

<div class="org-src-container">
<pre class="src src-shell">warning: unused <span style="color: #f78fe7;">`Result`</span> that must be used
 --&gt; src/main.rs:9:5
  |
9 |     stdin.read_line(&amp;mut buffer);
  |     ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  |
  = note: <span style="color: #f78fe7;">`#[warn(unused_must_use)]`</span> on by default
  = note: this <span style="color: #f78fe7;">`Result`</span> may be an <span style="color: #f78fe7;">`Err`</span> variant, which should be handled
</pre>
</div>

<p>
Things can fail, especially when you're interacting with the outside world you don't know who and what you can trust. In Rust things that can fail are encapsulated in a <code>Result&lt;T, E&gt;</code> enum type which has two members <code>Ok(T)</code> and <code>Err(E)</code>. <code>T</code> and <code>E</code> are generic type parameters and are placeholders for any type; this is called generics and works on the surface similarly to generics in TypeScript.
</p>

<p>
If you look at the type signature of <code>stdin.readline()</code> you will see that it has a return type of <code>std::io::Result&lt;usize&gt;</code>. That means that it will either return a <code>Ok(usize)</code> with the number of bytes read, or an <code>Err(std::io::Error)</code>. <code>usize</code> is one of Rust's many numeric types and represents the unsigned default integer size for your computer (most likely 64 bit or 32 bit).
</p>

<p>
By using <code>unwrap()</code> we discardi the error handling and blindly trust the operation will succeed. This is not great since if the operation fails we're not giving the user, or us for that matter, any relevant information about what failed. We can do better!
</p>

<p>
Since it's an enum we can treat it like we did our other enums: <code>match</code>!
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #b6a0ff;">match</span> stdin.read_line(&amp;<span style="color: #b6a0ff;">mut</span> buffer) {
    <span style="color: #6ae4b9;">Ok</span>(_) =&gt; {
        <span style="color: #f78fe7;">println!</span>(<span style="color: #79a8ff;">"You wrote: </span><span style="color: #79a8ff; font-style: italic;">{}</span><span style="color: #79a8ff;">"</span>, buffer);
    }
    <span style="color: #6ae4b9;">Err</span>(err) =&gt; {
        <span style="color: #f78fe7;">println!</span>(<span style="color: #79a8ff;">"Failed to read user input! </span><span style="color: #79a8ff; font-style: italic;">{:?}</span><span style="color: #79a8ff;">"</span>, err);
    }
}
</pre>
</div>

<p>
The above pattern quickly becomes unwieldy and if we don't want to deal with the underlying error can use <code>expect</code> instead which allows us to provide a message if the operation fails:
</p>

<div class="org-src-container">
<pre class="src src-rust">stdin
    .read_line(&amp;<span style="color: #b6a0ff;">mut</span> buffer)
    .expect(<span style="color: #79a8ff;">"Failed to read from stdin"</span>);
</pre>
</div>

<p>
The most idiomatic way however, and the one that combines brevity with explicitness is the <code>?</code> operator. By appending the <code>?</code> operator to a function call the call will either return the value inside the <code>Ok</code> type, or abort the parent function returning the error. This means we have to do a few changes to our <code>main</code> function:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #b6a0ff;">fn</span> <span style="color: #feacd0;">main</span>() -&gt; <span style="color: #6ae4b9;">Result</span>&lt;(), <span style="color: #00bcff;">io</span>::<span style="color: #6ae4b9;">Error</span>&gt; {
    <span style="color: #b6a0ff;">let</span> <span style="color: #b6a0ff;">mut</span> <span style="color: #00d3d0;">buffer</span> = <span style="color: #6ae4b9;">String</span>::new();
    <span style="color: #b6a0ff;">let</span> <span style="color: #00d3d0;">stdin</span> = <span style="color: #00bcff;">io</span>::stdin();

    <span style="color: #f78fe7;">println!</span>(<span style="color: #79a8ff;">"Write something:"</span>);

    stdin.read_line(&amp;<span style="color: #b6a0ff;">mut</span> buffer)<span style="color: #f78fe7; font-weight: bold;">?</span>;

    <span style="color: #f78fe7;">println!</span>(<span style="color: #79a8ff;">"You wrote: </span><span style="color: #79a8ff; font-style: italic;">{}</span><span style="color: #79a8ff;">"</span>, buffer);

    <span style="color: #6ae4b9;">Ok</span>(())
}
</pre>
</div>

<p>
<b>EXERCISE 15:</b> Add error handling using the <code>?</code> operator.
</p>

<p>
We've changed the return type to be a result of either <code>Ok(())</code>, where <code>()</code> is void (similar here to <code>undefined</code> in JavaScript), or <code>Err(io::Error)</code>. Now we can happily add the <code>?</code> operator to the <code>read_line</code> call as long as we remember to return a result as well.
</p>

<p>
There are more sophisticated ways to handle errors, but this is good enough for now!
</p>
</div>
</div>

<div id="outline-container-orgb6867d6" class="outline-3">
<h3 id="orgb6867d6"><span class="section-number-3">3.3.</span> Turning user input into HandShape</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Before we can call our <code>execute_round</code> function we need to take the user input and convert it into a <code>HandShape</code>. Let's implement a function <code>to_handshape(s: String) -&gt; Result&lt;HandShape, String&gt;</code> (we'll use <code>String</code> as the error type) which can turn the user input into a <code>HandShape</code>.
</p>

<p>
<b>EXERCISE 16</b>: Implement <code>to_handshape</code> as described above.
</p>
</div>

<div id="outline-container-org488ecc2" class="outline-4">
<h4 id="org488ecc2">The TryFrom trait</h4>
<div class="outline-text-4" id="text-org488ecc2">
<p>
While the above approach works in Rust we often rely on methods like <code>from()</code>, <code>into()</code>, <code>try_from()</code> and <code>try_into()</code> to convert between types. You can add these methods to your type by implementing the traits <code>From&lt;T&gt;</code> and <code>TryFrom&lt;T&gt;</code>. In our case we'll need the <code>TryFrom</code> trait since we cannot turn every possible user input into a <code>HandShape</code>.
</p>

<p>
<b>EXERCISE 17</b>: Implement <code>TryFrom&lt;String&gt;</code> for <code>HandShape</code> and replace the call to <code>to_handshape</code> with <code>HandShape::try_from(buffer)</code>.
</p>
</div>
</div>

<div id="outline-container-org7c6ce69" class="outline-4">
<h4 id="org7c6ce69">String and &amp;str</h4>
<div class="outline-text-4" id="text-org7c6ce69">
<p>
One thing you quickly stumble upon in Rust is the fact that it has two types of strings: <code>String</code> and <code>&amp;str</code>. <code>String</code> is a mutable, heap allocated buffer. That is, you can modify it in place, grow it or shrink it. <code>str</code>, on the other hand, is called a <i>string slice</i> and is an immutable view of a contiguous sequence of UTF-8 bytes in memory. You almost always encounter <code>str</code> as a reference: <code>&amp;str</code>. <a href="https://blog.thoughtram.io/string-vs-str-in-rust/">This blog post</a> explains the difference in detail. We will briefly touch upon what a reference is when we go into ownership and borrowing.
</p>

<p>
In short, in-line strings in your code will always be of type <code>&amp;str</code> unless you explicitly turn them into <code>String</code>:s. As a beginner <code>String</code>:s are a bit easier to work with since you don't have to think about ownership and lifetimes as much.
</p>
</div>
</div>
</div>

<div id="outline-container-org95ac5d8" class="outline-3">
<h3 id="org95ac5d8"><span class="section-number-3">3.4.</span> Our game loop</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Now we should have all the pieces we need to start implementing our actual game loop. There are many ways to loop in Rust:
</p>

<ul class="org-ul">
<li><code>loop</code> is for infinite loops (which you can <code>break</code> out of)</li>
<li><code>while</code> for looping until a predicate is false</li>
<li><code>for</code> is for iterating over a iterator until it is empty</li>
</ul>

<p>
<b>EXERCISE 18:</b> Implement a game loop which loops until the player either wins or loses.
</p>

<p>
For now you can hard-code the computer's choice, we'll look into handling the computer player soon.
</p>

<p>
At this point you most likely have had the compiler, at one time or another, kindly tell you that you are using a value after it has been moved. Let's dig a little deeper into what that actually means and what we can do to resolve that kind of error.
</p>
</div>
