rust-paper-scissors.org
*** Ownership and borrowing
Rust has an memory model based on ownership, it helps us with variable allocation and deallocation and makes sure we're not trying to access or use a variable that has been deallocated, a so called null pointer. What it means in practice is that a value can only have *a single owner* at any given time. When you reassign a value to another variable the value is *moved* to the new variable and ownership transferred. If the value type implements the ~Copy~ trait the value will be copied to the new variable without any transferal of ownership. On the [[https://doc.rust-lang.org/std/marker/trait.Copy.html#implementors][Copy trait's documentation page]] you can easily see what native types implement it. See the example below:

#+begin_src rust
  let foo = String::from("Hello!");
  // value is moved to `bar` here
  let bar = foo;

  // Can't borrow `foo`s value here since it has been moved
  println!("foo: {}", foo);

  let x: usize = 42;
  // Since `usize` implements `Copy` the value is copied to
  // `y` instead of moved
  let y = x;

  // Which means that `x` can be safely borrowed by `println!()`
  println!("x: {}", x);
#+end_src

What makes ownership so important is that it controls memory deallocation of the varible: the value is deallocated when its owner variable goes out of scope. In Rust terminology we say that the variable has been /dropped/. It enables automatic memory management without a garbage collector.

In the following example we hit a borrow after move error where we try and read the user input into ~buffer~.

#+begin_src rust
  fn main() -> Result<(), io::Error> {
      let stdin = io::stdin();
      // The String buffer is allocated outside of the `loop`
      let mut buffer = String::new();

      loop {
          println!("Rock, paper or scissors?");
          // Borrow after move occurs here...
          stdin.read_line(&mut buffer)?;

          // ...since the value was here in the previous iteration
          if let Ok(shape) = HandShape::try_from(buffer) {
              match execute_round(shape, HandShape::Paper) {
                  // ...
              }
          } else {
              println!("Sorry, I didn't quite get that...");
          }
      }

      Ok(())
  }
#+end_src

*EXERCISE 19:* Figure out a way to resolve the borrow-after-move error. (Spoiler alert below)

How can we solve this issue? A quick and dirty solution is to move the String allocation into the loop so we get a new one on every iteration. But let's say that we're all of sudden extremely concerned with the performance and memory footprint of our application and thus we don't want to allocate new String instances when we don't need to: how do we solve it then?

Why is the ~buffer~ String moved into ~HandShape::try_from()~? Function parameters work just like variable assignments in that they take ownership of the value if its type does not implement the ~Copy~ trait. As we've seen in the example above ~String~ does not. However there's another option, /references/. References are prefixed with the ~&~ operator.

#+begin_src rust
  let foo = String::from("Hello!");
  // `bar` is assigned to a reference of `foo`, so ownership is not
  // transferred.
  let bar = &foo;

  // Which means this is fine!
  println!("foo: {}", foo);
#+end_src

By using a reference we are not setting the variable to the actual value but a referential pointer to it, so ownership is not transferred. Creating a reference is called /borrowing/ in Rust terminology. [[https://doc.rust-lang.org/book/ch04-02-references-and-borrowing.html][This chapter in the Rust language book]] explains references and borrowing in more detail.

*EXERCISE 20:* Change the ~TryFrom<String>~ implementation to ~TryFrom<&String>~.

The practice of taking references instead of values in function parameters is called pass-by-reference and should be preferred if possible to pass-by-value with which you can easily end up battling the Rust borrow checker.

There are more improvements we can do but we will leave it here for now. If you are interested even more idiomatic ways of solving the above issue you can have a look at [[https://github.com/iensu/janken/commit/3fa1267fc3f331e4e752fa35853e00b1fc244384][TryFrom<&str> instead of TryFrom<&String>]] and [[https://github.com/iensu/janken/commit/78a54d4b74fa651c5faa518414992d731f967097][Implementing FromStr instead of TryFrom]].

