docs/index.html

<div id="outline-container-org0cb5861" class="outline-4">
<h4 id="org0cb5861">Ownership and borrowing</h4>
<div class="outline-text-4" id="text-org0cb5861">
<p>
Rust has an memory model based on ownership, it helps us with variable allocation and deallocation and makes sure we're not trying to access or use a variable that has been deallocated, a so called null pointer. What it means in practice is that a value can only have <b>a single owner</b> at any given time. When you reassign a value to another variable the value is <b>moved</b> to the new variable and ownership transferred. If the value type implements the <code>Copy</code> trait the value will be copied to the new variable without any transferal of ownership. On the <a href="https://doc.rust-lang.org/std/marker/trait.Copy.html#implementors">Copy trait's documentation page</a> you can easily see what native types implement it. See the example below:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #b6a0ff;">let</span> <span style="color: #00d3d0;">foo</span> = <span style="color: #6ae4b9;">String</span>::from(<span style="color: #79a8ff;">"Hello!"</span>);
<span style="color: #a8a8a8; font-style: italic;">// </span><span style="color: #a8a8a8; font-style: italic;">value is moved to `bar` here</span>
<span style="color: #b6a0ff;">let</span> <span style="color: #00d3d0;">bar</span> = foo;

<span style="color: #a8a8a8; font-style: italic;">// </span><span style="color: #a8a8a8; font-style: italic;">Can't borrow `foo`s value here since it has been moved</span>
<span style="color: #f78fe7;">println!</span>(<span style="color: #79a8ff;">"foo: </span><span style="color: #79a8ff; font-style: italic;">{}</span><span style="color: #79a8ff;">"</span>, foo);

<span style="color: #b6a0ff;">let</span> <span style="color: #00d3d0;">x</span>: <span style="color: #6ae4b9;">usize</span> = 42;
<span style="color: #a8a8a8; font-style: italic;">// </span><span style="color: #a8a8a8; font-style: italic;">Since `usize` implements `Copy` the value is copied to</span>
<span style="color: #a8a8a8; font-style: italic;">// </span><span style="color: #a8a8a8; font-style: italic;">`y` instead of moved</span>
<span style="color: #b6a0ff;">let</span> <span style="color: #00d3d0;">y</span> = x;

<span style="color: #a8a8a8; font-style: italic;">// </span><span style="color: #a8a8a8; font-style: italic;">Which means that `x` can be safely borrowed by `println!()`</span>
<span style="color: #f78fe7;">println!</span>(<span style="color: #79a8ff;">"x: </span><span style="color: #79a8ff; font-style: italic;">{}</span><span style="color: #79a8ff;">"</span>, x);
</pre>
</div>

<p>
What makes ownership so important is that it controls memory deallocation of the varible: the value is deallocated when its owner variable goes out of scope. In Rust terminology we say that the variable has been <i>dropped</i>. It enables automatic memory management without a garbage collector.
</p>

<p>
In the following example we hit a borrow after move error where we try and read the user input into <code>buffer</code>.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #b6a0ff;">fn</span> <span style="color: #feacd0;">main</span>() -&gt; <span style="color: #6ae4b9;">Result</span>&lt;(), <span style="color: #00bcff;">io</span>::<span style="color: #6ae4b9;">Error</span>&gt; {
    <span style="color: #b6a0ff;">let</span> <span style="color: #00d3d0;">stdin</span> = <span style="color: #00bcff;">io</span>::stdin();
    <span style="color: #a8a8a8; font-style: italic;">// </span><span style="color: #a8a8a8; font-style: italic;">The String buffer is allocated outside of the `loop`</span>
    <span style="color: #b6a0ff;">let</span> <span style="color: #b6a0ff;">mut</span> <span style="color: #00d3d0;">buffer</span> = <span style="color: #6ae4b9;">String</span>::new();

    <span style="color: #b6a0ff;">loop</span> {
        <span style="color: #f78fe7;">println!</span>(<span style="color: #79a8ff;">"Rock, paper or scissors?"</span>);
        <span style="color: #a8a8a8; font-style: italic;">// </span><span style="color: #a8a8a8; font-style: italic;">Borrow after move occurs here...</span>
        stdin.read_line(&amp;<span style="color: #b6a0ff;">mut</span> buffer)<span style="color: #f78fe7; font-weight: bold;">?</span>;

        <span style="color: #a8a8a8; font-style: italic;">// </span><span style="color: #a8a8a8; font-style: italic;">...since the value was here in the previous iteration</span>
        <span style="color: #b6a0ff;">if</span> <span style="color: #b6a0ff;">let</span> <span style="color: #6ae4b9;">Ok</span>(shape) = <span style="color: #6ae4b9;">HandShape</span>::try_from(buffer) {
            <span style="color: #b6a0ff;">match</span> execute_round(shape, <span style="color: #6ae4b9;">HandShape</span>::<span style="color: #6ae4b9;">Paper</span>) {
                <span style="color: #a8a8a8; font-style: italic;">// </span><span style="color: #a8a8a8; font-style: italic;">...</span>
            }
        } <span style="color: #b6a0ff;">else</span> {
            <span style="color: #f78fe7;">println!</span>(<span style="color: #79a8ff;">"Sorry, I didn't quite get that..."</span>);
        }
    }

    <span style="color: #6ae4b9;">Ok</span>(())
}
</pre>
</div>

<p>
<b>EXERCISE 19:</b> Figure out a way to resolve the borrow-after-move error. (Spoiler alert below)
</p>

<p>
How can we solve this issue? A quick and dirty solution is to move the String allocation into the loop so we get a new one on every iteration. But let's say that we're all of sudden extremely concerned with the performance and memory footprint of our application and thus we don't want to allocate new String instances when we don't need to: how do we solve it then?
</p>

<p>
Why is the <code>buffer</code> String moved into <code>HandShape::try_from()</code>? Function parameters work just like variable assignments in that they take ownership of the value if its type does not implement the <code>Copy</code> trait. As we've seen in the example above <code>String</code> does not. However there's another option, <i>references</i>. References are prefixed with the <code>&amp;</code> operator.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #b6a0ff;">let</span> <span style="color: #00d3d0;">foo</span> = <span style="color: #6ae4b9;">String</span>::from(<span style="color: #79a8ff;">"Hello!"</span>);
<span style="color: #a8a8a8; font-style: italic;">// </span><span style="color: #a8a8a8; font-style: italic;">`bar` is assigned to a reference of `foo`, so ownership is not</span>
<span style="color: #a8a8a8; font-style: italic;">// </span><span style="color: #a8a8a8; font-style: italic;">transferred.</span>
<span style="color: #b6a0ff;">let</span> <span style="color: #00d3d0;">bar</span> = &amp;foo;

<span style="color: #a8a8a8; font-style: italic;">// </span><span style="color: #a8a8a8; font-style: italic;">Which means this is fine!</span>
<span style="color: #f78fe7;">println!</span>(<span style="color: #79a8ff;">"foo: </span><span style="color: #79a8ff; font-style: italic;">{}</span><span style="color: #79a8ff;">"</span>, foo);
</pre>
</div>

<p>
By using a reference we are not setting the variable to the actual value but a referential pointer to it, so ownership is not transferred. Creating a reference is called <i>borrowing</i> in Rust terminology. <a href="https://doc.rust-lang.org/book/ch04-02-references-and-borrowing.html">This chapter in the Rust language book</a> explains references and borrowing in more detail.
</p>

<p>
<b>EXERCISE 20:</b> Change the <code>TryFrom&lt;String&gt;</code> implementation to <code>TryFrom&lt;&amp;String&gt;</code>.
</p>

<p>
The practice of taking references instead of values in function parameters is called pass-by-reference and should be preferred if possible to pass-by-value with which you can easily end up battling the Rust borrow checker.
</p>

<p>
There are more improvements we can do but we will leave it here for now. If you are interested even more idiomatic ways of solving the above issue you can have a look at <a href="https://github.com/iensu/janken/commit/3fa1267fc3f331e4e752fa35853e00b1fc244384">TryFrom&lt;&amp;str&gt; instead of TryFrom&lt;&amp;String&gt;</a> and <a href="https://github.com/iensu/janken/commit/78a54d4b74fa651c5faa518414992d731f967097">Implementing FromStr instead of TryFrom</a>.
</p>
</div>
</div>
</div>
