rust-paper-scissors.org
** Making it random
Currently our adversary is just responding with the same hand shape everytime, not much fun at all. We need a way to make it respond with different shapes each time. Oddly enough Rust does not provide an easy way of generating random numbers in its standard library, so we will have to some foraging to find a suitable package on https://crates.io, Rust's crate registry.

Among the most popular crates we see [[https://crates.io/crates/rand][the rand crate]] which is the go-to crate for all your randomization needs.

*EXERCISE 21:* Add ~rand~ as a dependency in Cargo.toml:

#+begin_src toml
  [package]
  name = "janken"
  version = "0.1.0"
  edition = "2021"

  [dependencies]
  rand = "0.8.4"
#+end_src

*EXERCISE 22:* Have a look at [[https://rust-random.github.io/book/guide-start.html][the rand documentation]] and find a way to generate a random ~HandShape~.

You did it! You have built a very simple, but functional, implementation of rock, paper, scissors in Rust. However, we have barely scratched the surface of what the Rust language has to offer, we haven't even touched upon ~struct~:s, lifetimes or iterator patterns for instance. While there is still a lot more to discover, you should at least have gotten a sense of the Rust workflow and the language itself. Now it's up to you to either take your /janken/ application to new heights, or find some other project to implement and learn more of Rust.

* Where to go next
If I managed to whet your appetite for more, here are a some great resources I found very useful when learning Rust:

*Getting started*
- [[https://doc.rust-lang.org/book/][The Rust Book]]
- [[https://github.com/rust-lang/rustlings/][The Rustlings course]]
- [[https://doc.rust-lang.org/stable/rust-by-example/][Rust by Example]]
- [[https://www.youtube.com/c/RyanLevicksVideos/videos][Ryan Levick's Rust videos]]
- [[https://pragprog.com/titles/khrust/programming-webassembly-with-rust/][Programming WebAssembly with Rust]]

*Intermediate*
- [[https://doc.rust-lang.org/std/index.html][Standard library documentation]]
- [[https://www.zero2prod.com/index.html?country=Sweden&discount_code=VAT20][Zero To Production in Rust]]
- [[https://www.youtube.com/playlist?list=PLqbS7AVVErFiWDOAVrPt7aYmnuuOLYvOa][Crust of Rust]] (Video series by Jon Gjengset)

*Advanced*
- [[https://www.youtube.com/c/JonGjengset/featured][Jon Gjengset's other Rust videos]]
