docs/index.html

<div id="outline-container-orga944c66" class="outline-3">
<h3 id="orga944c66"><span class="section-number-3">3.5.</span> Making it random</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Currently our adversary is just responding with the same hand shape everytime, not much fun at all. We need a way to make it respond with different shapes each time. Oddly enough Rust does not provide an easy way of generating random numbers in its standard library, so we will have to some foraging to find a suitable package on <a href="https://crates.io">https://crates.io</a>, Rust's crate registry.
</p>

<p>
Among the most popular crates we see <a href="https://crates.io/crates/rand">the rand crate</a> which is the go-to crate for all your randomization needs.
</p>

<p>
<b>EXERCISE 21:</b> Add <code>rand</code> as a dependency in Cargo.toml:
</p>

<div class="org-src-container">
<pre class="src src-toml">[<span style="color: #6ae4b9;">package</span>]
<span style="color: #00d3d0;">name</span> = <span style="color: #79a8ff;">"janken"</span>
<span style="color: #00d3d0;">version</span> = <span style="color: #79a8ff;">"0.1.0"</span>
<span style="color: #00d3d0;">edition</span> = <span style="color: #79a8ff;">"2021"</span>

[<span style="color: #6ae4b9;">dependencies</span>]
<span style="color: #00d3d0;">rand</span> = <span style="color: #79a8ff;">"0.8.4"</span>
</pre>
</div>

<p>
<b>EXERCISE 22:</b> Have a look at <a href="https://rust-random.github.io/book/guide-start.html">the rand documentation</a> and find a way to generate a random <code>HandShape</code>.
</p>

<p>
You did it! You have built a very simple, but functional, implementation of rock, paper, scissors in Rust. However, we have barely scratched the surface of what the Rust language has to offer, we haven't even touched upon <code>struct</code>:s, lifetimes or iterator patterns for instance. While there is still a lot more to discover, you should at least have gotten a sense of the Rust workflow and the language itself. Now it's up to you to either take your <i>janken</i> application to new heights, or find some other project to implement and learn more of Rust.
</p>
</div>
</div>
</div>

<div id="outline-container-orgfff5c83" class="outline-2">
<h2 id="orgfff5c83"><span class="section-number-2">4.</span> Where to go next</h2>
<div class="outline-text-2" id="text-4">
<p>
If I managed to whet your appetite for more, here are a some great resources I found very useful when learning Rust:
</p>

<p>
<b>Getting started</b>
</p>
<ul class="org-ul">
<li><a href="https://doc.rust-lang.org/book/">The Rust Book</a></li>
<li><a href="https://github.com/rust-lang/rustlings/">The Rustlings course</a></li>
<li><a href="https://doc.rust-lang.org/stable/rust-by-example/">Rust by Example</a></li>
<li><a href="https://www.youtube.com/c/RyanLevicksVideos/videos">Ryan Levick's Rust videos</a></li>
<li><a href="https://pragprog.com/titles/khrust/programming-webassembly-with-rust/">Programming WebAssembly with Rust</a></li>
</ul>

<p>
<b>Intermediate</b>
</p>
<ul class="org-ul">
<li><a href="https://doc.rust-lang.org/std/index.html">Standard library documentation</a></li>
<li><a href="https://www.zero2prod.com/index.html?country=Sweden&amp;discount_code=VAT20">Zero To Production in Rust</a></li>
<li><a href="https://www.youtube.com/playlist?list=PLqbS7AVVErFiWDOAVrPt7aYmnuuOLYvOa">Crust of Rust</a> (Video series by Jon Gjengset)</li>
</ul>

<p>
<b>Advanced</b>
</p>
<ul class="org-ul">
<li><a href="https://www.youtube.com/c/JonGjengset/featured">Jon Gjengset's other Rust videos</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jens Östlund</p>
<p class="date">Created: 2021-12-09 Thu 13:26</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
